###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID ictc-eda-be-9-ldap-1)
#  Generated on:      Sat Jun 20 17:13:57 2026
#  Design:            croc_chip
#  Command:           set_analysis_view -setup [all_setup_analysis_views ] -hold [all_hold_analysis_views ]
###############################################################
current_design croc_chip
create_clock [get_ports {ref_clk_i}]  -name clk_rtc -period 50.000000 -waveform {0.000000 25.000000}
set_propagated_clock  [get_clocks {clk_rtc}]
set_clock_transition  -rise -min 0.1 [get_clocks {clk_rtc}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk_rtc}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk_rtc}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk_rtc}]
create_clock [get_ports {clk_i}]  -name clk_sys -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_clocks {clk_sys}]
set_clock_transition  -rise -min 0.1 [get_clocks {clk_sys}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk_sys}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk_sys}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk_sys}]
create_clock [get_ports {jtag_tck_i}]  -name clk_jtg -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_clocks {clk_jtg}]
set_clock_transition  -rise -min 0.1 [get_clocks {clk_jtg}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk_jtg}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk_jtg}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk_jtg}]
set_propagated_clock  [get_ports {jtag_tck_i}]
set_propagated_clock  [get_ports {clk_i}]
set_propagated_clock  [get_ports {ref_clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {rst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {ref_clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {ref_clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {ref_clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {ref_clk_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {jtag_tck_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {jtag_tck_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {jtag_tck_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {jtag_tck_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {jtag_trst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {jtag_trst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {jtag_trst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {jtag_trst_ni}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {jtag_tms_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {jtag_tms_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {jtag_tms_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {jtag_tms_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {jtag_tdi_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {jtag_tdi_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {jtag_tdi_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {jtag_tdi_i}]
set_load -pin_load -max  15  [get_ports {jtag_tdo_o}]
set_load -pin_load -min  15  [get_ports {jtag_tdo_o}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {uart_rx_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {uart_rx_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {uart_rx_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {uart_rx_i}]
set_load -pin_load -max  15  [get_ports {uart_tx_o}]
set_load -pin_load -min  15  [get_ports {uart_tx_o}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {fetch_en_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {fetch_en_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {fetch_en_i}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {fetch_en_i}]
set_load -pin_load -max  15  [get_ports {status_o}]
set_load -pin_load -min  15  [get_ports {status_o}]
set_load -pin_load -max  15  [get_ports {gpio0_io}]
set_load -pin_load -min  15  [get_ports {gpio0_io}]
set_load -pin_load -max  15  [get_ports {gpio1_io}]
set_load -pin_load -min  15  [get_ports {gpio1_io}]
set_load -pin_load -max  15  [get_ports {gpio2_io}]
set_load -pin_load -min  15  [get_ports {gpio2_io}]
set_load -pin_load -max  15  [get_ports {gpio3_io}]
set_load -pin_load -min  15  [get_ports {gpio3_io}]
set_load -pin_load -max  15  [get_ports {gpio4_io}]
set_load -pin_load -min  15  [get_ports {gpio4_io}]
set_load -pin_load -max  15  [get_ports {gpio5_io}]
set_load -pin_load -min  15  [get_ports {gpio5_io}]
set_load -pin_load -max  15  [get_ports {gpio6_io}]
set_load -pin_load -min  15  [get_ports {gpio6_io}]
set_load -pin_load -max  15  [get_ports {gpio7_io}]
set_load -pin_load -min  15  [get_ports {gpio7_io}]
set_load -pin_load -max  15  [get_ports {gpio8_io}]
set_load -pin_load -min  15  [get_ports {gpio8_io}]
set_load -pin_load -max  15  [get_ports {gpio9_io}]
set_load -pin_load -min  15  [get_ports {gpio9_io}]
set_load -pin_load -max  15  [get_ports {gpio10_io}]
set_load -pin_load -min  15  [get_ports {gpio10_io}]
set_load -pin_load -max  15  [get_ports {gpio11_io}]
set_load -pin_load -min  15  [get_ports {gpio11_io}]
set_load -pin_load -max  15  [get_ports {gpio12_io}]
set_load -pin_load -min  15  [get_ports {gpio12_io}]
set_load -pin_load -max  15  [get_ports {gpio13_io}]
set_load -pin_load -min  15  [get_ports {gpio13_io}]
set_load -pin_load -max  15  [get_ports {gpio14_io}]
set_load -pin_load -min  15  [get_ports {gpio14_io}]
set_load -pin_load -max  15  [get_ports {gpio15_io}]
set_load -pin_load -min  15  [get_ports {gpio15_io}]
set_load -pin_load -max  15  [get_ports {gpio16_io}]
set_load -pin_load -min  15  [get_ports {gpio16_io}]
set_load -pin_load -max  15  [get_ports {gpio17_io}]
set_load -pin_load -min  15  [get_ports {gpio17_io}]
set_load -pin_load -max  15  [get_ports {gpio18_io}]
set_load -pin_load -min  15  [get_ports {gpio18_io}]
set_load -pin_load -max  15  [get_ports {gpio19_io}]
set_load -pin_load -min  15  [get_ports {gpio19_io}]
set_load -pin_load -max  15  [get_ports {gpio20_io}]
set_load -pin_load -min  15  [get_ports {gpio20_io}]
set_load -pin_load -max  15  [get_ports {gpio21_io}]
set_load -pin_load -min  15  [get_ports {gpio21_io}]
set_load -pin_load -max  15  [get_ports {gpio22_io}]
set_load -pin_load -min  15  [get_ports {gpio22_io}]
set_load -pin_load -max  15  [get_ports {gpio23_io}]
set_load -pin_load -min  15  [get_ports {gpio23_io}]
set_load -pin_load -max  15  [get_ports {gpio24_io}]
set_load -pin_load -min  15  [get_ports {gpio24_io}]
set_load -pin_load -max  15  [get_ports {gpio25_io}]
set_load -pin_load -min  15  [get_ports {gpio25_io}]
set_load -pin_load -max  15  [get_ports {gpio26_io}]
set_load -pin_load -min  15  [get_ports {gpio26_io}]
set_load -pin_load -max  15  [get_ports {gpio27_io}]
set_load -pin_load -min  15  [get_ports {gpio27_io}]
set_load -pin_load -max  15  [get_ports {gpio28_io}]
set_load -pin_load -min  15  [get_ports {gpio28_io}]
set_load -pin_load -max  15  [get_ports {gpio29_io}]
set_load -pin_load -min  15  [get_ports {gpio29_io}]
set_load -pin_load -max  15  [get_ports {gpio30_io}]
set_load -pin_load -min  15  [get_ports {gpio30_io}]
set_load -pin_load -max  15  [get_ports {gpio31_io}]
set_load -pin_load -min  15  [get_ports {gpio31_io}]
set_load -pin_load -max  15  [get_ports {unused0_o}]
set_load -pin_load -min  15  [get_ports {unused0_o}]
set_load -pin_load -max  15  [get_ports {unused1_o}]
set_load -pin_load -min  15  [get_ports {unused1_o}]
set_load -pin_load -max  15  [get_ports {unused2_o}]
set_load -pin_load -min  15  [get_ports {unused2_o}]
set_load -pin_load -max  15  [get_ports {unused3_o}]
set_load -pin_load -min  15  [get_ports {unused3_o}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio31_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio31_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio31_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio31_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio30_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio30_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio30_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio30_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio29_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio29_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio29_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio29_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio28_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio28_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio28_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio28_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio27_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio27_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio27_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio27_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio26_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio26_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio26_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio26_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio25_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio25_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio25_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio25_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio24_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio24_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio24_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio24_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio23_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio23_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio23_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio23_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio22_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio22_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio22_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio22_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio21_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio21_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio21_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio21_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio20_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio20_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio20_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio20_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio19_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio19_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio19_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio19_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio18_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio18_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio18_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio18_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio17_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio17_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio17_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio17_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio16_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio16_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio16_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio16_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio15_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio15_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio15_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio15_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio14_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio14_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio14_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio14_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio13_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio13_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio13_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio13_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio12_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio12_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio12_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio12_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio11_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio11_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio11_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio11_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio10_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio10_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio10_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio10_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio9_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio9_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio9_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio9_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio8_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio8_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio8_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio8_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio7_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio7_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio7_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio7_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio6_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio6_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio6_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio6_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio5_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio5_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio5_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio5_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio4_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio4_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio4_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio4_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio3_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio3_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio3_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio3_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio2_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio2_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio2_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio2_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio1_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio1_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio1_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio1_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -min -pin pad [get_ports {gpio0_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -min -pin pad [get_ports {gpio0_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -rise -max -pin pad [get_ports {gpio0_io}]
set_driving_cell -lib_cell sg13g2_IOPadOut16mA -fall -max -pin pad [get_ports {gpio0_io}]
set_max_fanout 32  [get_designs {croc_chip}]
set_max_transition 0.5  [get_designs {croc_chip}]
set_input_delay -add_delay 2 -max  [get_ports {rst_ni}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio10_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio10_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio21_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio21_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio14_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio14_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio0_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio0_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio25_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio25_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio18_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio18_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio4_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio4_io}]
set_input_delay -add_delay 2 -min -clock [get_clocks {clk_jtg}] [get_ports {jtag_tdi_i}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk_jtg}] [get_ports {jtag_tdi_i}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio29_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio29_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio8_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio8_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio11_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio11_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio22_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio22_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio15_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio15_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio1_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio1_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio26_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio26_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio19_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio19_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio5_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio5_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio9_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio9_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio12_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio12_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio30_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio30_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio23_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio23_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio16_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio16_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio2_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio2_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio27_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio27_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio6_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio6_io}]
set_input_delay -add_delay 2 -min -clock [get_clocks {clk_jtg}] [get_ports {jtag_tms_i}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk_jtg}] [get_ports {jtag_tms_i}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio20_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio20_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio13_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio13_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {uart_rx_i}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {uart_rx_i}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio31_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio31_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio24_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio24_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio17_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio17_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio3_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio3_io}]
set_input_delay -add_delay 2 -max  [get_ports {jtag_trst_ni}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio28_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio28_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio7_io}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio7_io}]
set_input_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {fetch_en_i}]
set_input_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {fetch_en_i}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio10_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio10_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio0_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio0_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio14_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio14_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio21_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio21_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {status_o}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {status_o}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio4_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio4_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio18_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio18_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio25_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio25_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio8_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio8_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio29_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio29_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio11_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio11_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {uart_tx_o}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {uart_tx_o}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio1_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio1_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio15_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio15_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio22_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio22_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio5_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio5_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio19_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio19_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio26_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio26_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio9_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio9_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio12_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio12_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio2_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio2_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio16_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio16_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio23_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio23_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio30_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio30_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_jtg}] [get_ports {jtag_tdo_o}]
set_output_delay -add_delay 5 -max -clock [get_clocks {clk_jtg}] [get_ports {jtag_tdo_o}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio6_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio6_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio27_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio27_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio13_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio13_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio20_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio20_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio3_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio3_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio17_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio17_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio24_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio24_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio31_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio31_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio7_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio7_io}]
set_output_delay -add_delay 1 -min -clock [get_clocks {clk_sys}] [get_ports {gpio28_io}]
set_output_delay -add_delay 3 -max -clock [get_clocks {clk_sys}] [get_ports {gpio28_io}]
set_clock_uncertainty 0.1 [get_clocks {clk_rtc}]
set_clock_uncertainty 0.1 [get_clocks {clk_jtg}]
set_clock_uncertainty 0.1 [get_clocks {clk_sys}]
set_false_path -hold  -through [get_pins {i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_req_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_9__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_8__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_7__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_6__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_5__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_4__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_40__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_3__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_39__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_38__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_37__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_36__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_35__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_34__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_33__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_32__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_31__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_30__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_2__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_29__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_28__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_27__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_26__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_25__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_24__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_23__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_22__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_21__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_20__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_1__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_19__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_18__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_17__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_16__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_15__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_14__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_13__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_12__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_11__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_10__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_0__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_dst/async_ack_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_req_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_9__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_8__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_7__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_6__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_5__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_4__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_3__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_33__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_32__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_31__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_30__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_2__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_29__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_28__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_27__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_26__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_25__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_24__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_23__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_22__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_21__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_20__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_1__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_19__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_18__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_17__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_16__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_15__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_14__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_13__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_12__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_11__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_10__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_0__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_dst/async_ack_o_reg/Q}] 
set_max_delay 3.5  -ignore_clock_latency -through [get_pins {i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_req_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_9__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_8__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_7__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_6__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_5__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_4__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_40__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_3__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_39__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_38__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_37__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_36__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_35__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_34__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_33__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_32__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_31__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_30__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_2__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_29__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_28__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_27__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_26__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_25__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_24__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_23__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_22__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_21__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_20__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_1__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_19__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_18__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_17__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_16__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_15__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_14__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_13__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_12__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_11__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_10__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_src/async_data_o_0__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_dst/async_ack_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_req_o_reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_9__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_8__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_7__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_6__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_5__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_4__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_3__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_33__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_32__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_31__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_30__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_2__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_29__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_28__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_27__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_26__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_25__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_24__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_23__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_22__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_21__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_20__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_1__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_19__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_18__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_17__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_16__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_15__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_14__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_13__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_12__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_11__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_10__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_src/async_data_o_0__reg/Q i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_resp/i_dst/async_ack_o_reg/Q}] 
set_false_path -hold  -from [get_ports {rst_ni jtag_trst_ni}] 
set_max_delay 10  -from [get_ports {rst_ni}] 
set_max_delay 20  -from [get_ports {jtag_trst_ni}] 
set_clock_groups -name clk_groups_async -asynchronous  -group  [get_clocks {clk_rtc}] -group  [get_clocks {clk_jtg}] -group  [get_clocks {clk_sys}]
